cfd/openfoam/compressible/rhoPimpleFoam/01_Laminar/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// ************************************************************************** //

simulationType  laminar;

// ************************************************************************** //
