cfd/openfoam/compressible/rhoPimpleFoam/01_Laminar/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

// ************************************************************************** //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

// ************************************************************************** //

mixture
{
    specie
    {
        molWeight   28.9;
    }
    thermodynamics
    {
        Cv          712;
        Hf          0;
    }
    transport
    {
        mu          1.8e-05;
        Pr          0.7;
    }
}

// ************************************************************************** //
