cfd/openfoam/compressible/rhoPimpleFoam/01_Laminar/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

// ************************************************************************** //

#include "include/boundaryConditions"

// ************************************************************************** //

dimensions [ 1 -1 -2 0 0 0 0 ];

// ************************************************************************** //

internalField uniform $pressure;

// ************************************************************************** //

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        $pressure;
        lInf            5;
        value           uniform $pressure;
    }

    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform $pressure;
    }
    
    model
    {
        type            zeroGradient;
    }
    
    "proc.*"
    {
        type            processor;
    }
}

// ************************************************************************** //
