cfd/openfoam/compressible/rhoPimpleFoam/01_Laminar/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

// ************************************************************************** //

#include "include/relaxationFactors"

// ************************************************************************** //

solvers
{
    "(p|rho)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(p|rho)Final"
    {
        $p;
        relTol          0;
    }

    "(U|e)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|e)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 3;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;

    pMinFactor      0.5;
    pMaxFactor      2.0;
    
    transonic yes;
}

relaxationFactors
{
    fields
    {
        p               $relaxationFactors_p;
        rho             $relaxationFactors_rho;
    }
    equations
    {
        U               $relaxationFactors_U;
        e               $relaxationFactors_e;
    }
}

// ************************************************************************** //
